Repository: pingfangx/TranslatorX-other
Catalog: Gradle/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Upload the Gradle distribution archive to a HTTP server.
zh_cn: 将 Gradle 分发包上载到 HTTP 服务器。

source: Upon discovery of the directory, Gradle automatically compiles and tests this code and puts it in the classpath of your build script.
zh_cn: 发现目录后，Gradle 会自动编译和测试此代码，并将其放入构建脚本的类路径中。

source: Use buildSrc to abstract imperative logic
zh_cn: 使用 buildSrc 抽象必要逻辑

source: Use case
zh_cn: 用例

source: Use standard conventions as much as possible
zh_cn: 尽量使用标准的约定插件

source: User Manual PDF
zh_cn: 用户手册 PDF

source: Using Gradle Plugins
zh_cn: 使用 Gradle 插件

source: Using Initialization Scripts
zh_cn: 使用初始化脚本

source: Using classes from the main source set
zh_cn: 使用主源码集中的类

source: Using plugins
zh_cn: 使用插件

source: Using the Build Cache
zh_cn: 使用构建缓存

source: Using the Configuration Cache
zh_cn: 使用配置缓存

source: Using your plugin in another project
zh_cn: 在其项目中使用插件

source: Usually, subprojects in a multi-project build share some common traits.
zh_cn: 通常，多项目中的子项目的构建会具有一些共同的特征。

source: Verifying dependencies
zh_cn: 验证依赖

source: Viewing and Debugging Dependencies
zh_cn: 查看和调试依赖

source: We can model this use case by layering two separate plugins that each define the type of project that applies them:
zh_cn: 我们可以通过分层两个独立的插件来建模这个用例，每个插件定义应用它们的项目类型：

source: We recommend putting source code and tests for the convention plugins in the special buildSrc directory in the root directory of the project.
zh_cn: 我们建议将约定插件（译注：convention plugin，后同）的源代码和测试代码，放在项目根目录的特殊 buildSrc 目录中。

source: We recommend that you also create a buildSrc/settings.gradle.kts file, which you may leave empty.
zh_cn: 我们建议你也创建一个 buildSrc/settings.gradle.kts 文件，可以将其留空。

source: We recommend that you also create a buildSrc/settings.gradle file, which you may leave empty.
zh_cn: 我们建议你也创建一个 buildSrc/settings.gradle 文件，可以将其留空。

source: What is Dependency Management?
zh_cn: 什么是依赖管理？

source: What is Gradle?
zh_cn: 什么是 Gradle？

source: What is new?
zh_cn: 新版说明

source: What plugins do
zh_cn: 插件做什么

source: When declaring the outputs of a task, make sure that the directory for writing outputs is unique among all the tasks in your project.
zh_cn: 声明任务的输出时，请确保用于写入输出的目录在项目中的所有任务中是唯一的。

source: When developing Gradle Plugins, it is important to be cautious when logging information to the build log.
zh_cn: 在开发 Gradle 插件时，在将信息记录到构建日志中时一定要谨慎。

source: When developing custom tasks and plugins, it’s a good idea to be very flexible when accepting input configuration for file locations.
zh_cn: 在开发自定义任务和插件时，最好在接受文件位置的输入配置时非常灵活。

source: When the plugin is applied to a project, Gradle creates an instance of the plugin class and calls the instance’s Plugin.apply() method.
zh_cn: 当插件应用于项目时，Gradle 会创建插件类的一个实例，并调用该实例的 Plugin.apply() 方法。

source: Where «plugin id» and «plugin version» must be constant, literal, strings and the apply statement with a boolean can be used to disable the default behavior of applying the plugin immediately (e.g. you want to apply it only in subprojects).
zh_cn: 其中 «plugin id» 和 «plugin version» 必须是常量，字面量，字符串，带 boolean 的 apply 语句可用于禁用立即应用插件的默认行为(例如，你希望仅在 subprojects 中应用它)。

source: Where «plugin id», in case #1 is a static Kotlin extension property, named after the core plugin ID ; and in cases #2 and #3 is a string.
zh_cn: 其中 «plugin id»限制为，场景 #1 是一个静态 Kotlin 扩展属性，以核心插件 id 命名；场景 #2 和 #3 是一个字符串。

source: Where you put the plugin id depends on whether you are using the plugins DSL or the buildscript block.
zh_cn: 放置插件 id 的位置取决于你使用的是 plugins DSL 还是 buildscript 块。

source: While those conventions can be reconfigured, it makes it harder to build script users and authors to manage the build logic and its outcome.
zh_cn: 虽然这些约定可以重新配置，但它使构建脚本的用户和作者更难管理构建逻辑及其结果。

source: Why use the Build Cache?
zh_cn: 为什么要使用构建缓存？

source: With cross configuration, build logic can be injected into a subproject and this is not obvious when looking at the subproject’s build script, making it harder to understand the logic of a particular subproject.
zh_cn: 通过跨项目配置，可以将构建逻辑注入子项目，但这在查看子项目的构建脚本时不能明显看到，使得难以理解特定子项目的逻辑。

source: With the introduction of the plugins DSL, users should have little reason to use the legacy method of applying plugins.
zh_cn: 随着 plugins DSL 的引入，用户应该一般不会使用应用插件的旧版方法。

source: Working with Dependencies
zh_cn: 使用依赖

source: Working with Files
zh_cn: 文件相关操作

source: Working with Logging
zh_cn: 使用日志记录

source: Working with files in custom tasks and plugins
zh_cn: 在自定义任务和插件中使用文件

source: Writing Build Scripts
zh_cn: 编写构建脚本

source: Writing Custom Gradle Types and Service Injection
zh_cn: 编写自定义 Gradle 类型和服务注入

source: Writing Gradle Task Types
zh_cn: 编写 Gradle 任务类型

source: Writing a simple plugin
zh_cn: 写一个简单的插件

source: Writing tests for your plugin
zh_cn: 为插件编写测试

source: You apply plugins by their plugin id, which is a globally unique identifier, or name, for plugins.
zh_cn: 你可以通过插件的 plugin id 来应用插件，该 id 是插件的全局唯一标识符或名称。

source: You can achieve that with the help of initialization scripts.
zh_cn: 你可以通过初始化脚本来实现这一点。

source: You can apply plugins that reside in a project’s buildSrc directory as long as they have a defined ID.
zh_cn: 你可以应用驻留在项目的 buildSrc 目录中的插件，只要它们具有定义的 ID 即可。

source: You can compose custom build logic by applying and configuring both core and external plugins and create custom plugins that define new project types and configure conventions specific to your project or organization.
zh_cn: 您可以通过应用和配置核心插件和外部插件来组合自定义构建逻辑，创建自定义插件，定义新的项目 类型，并配置特定于您的项目或组织的约定逻辑。

source: You can create a separate project for your plugin.
zh_cn: 你可以为插件创建一个单独的项目。

source: You can find out more about implementing project extensions in Developing Custom Gradle Types.
zh_cn: 您可以在 Developing Custom Gradle Types 中了解有关实现项目扩展的更多信息。

source: You can implement a Gradle plugin in any language you like, provided the implementation ends up compiled as JVM bytecode.
zh_cn: 你可以用任何喜欢的语言实现 Gradle 插件，前提是该语言最终编译为 JVM 字节码。

source: You can include the source for the plugin directly in the build script.
zh_cn: 你可以在构建脚本中直接包含插件的源代码。

source: You can open this sample inside an IDE using the IntelliJ native importer or Eclipse Buildship.
zh_cn: 你可以使用 IntelliJ native importer 或 Eclipse Buildship 在 IDE 中打开此示例。

source: You can provide configuration for your plugin by adding an extension object to this container.
zh_cn: 你可以通过向该容器添加扩展对象来为插件提供配置。

source: You can put the source for the plugin in the rootProjectDir/buildSrc/src/main/java directory (or rootProjectDir/buildSrc/src/main/groovy or rootProjectDir/buildSrc/src/main/kotlin depending on which language you prefer).
zh_cn: 取决于你喜欢的语言，你可以将插件的源代码放在 rootProjectDir/buildSrc/src/main/java 目录中(或 rootProjectDir/buildSrc/src/main/groovy 或 rootProjectDir/buildSrc/src/main/kotlin)。

source: You can use the ProjectBuilder class to create Project instances to use when you test your plugin implementation.
zh_cn: 你可以使用 ProjectBuilder 类创建 Project 实例，以便在测试插件实现时使用。

source: You should use Gradle’s managed properties and project.layout to select file or directory locations.
zh_cn: 你应该使用 Gradle 的 managed properties 和 project.layout 以选择文件或目录位置。

source: You will notice that in the example above we specify the greetingFile property value after we have configured to use it for the task.
zh_cn: 你会注意到，在上面的示例中，我们在配置为将其用于任务后才指定了 greetingFile 属性值。

source: You write these as *.gradle files in src/main/groovy directory or *.gradle.kts files in src/main/kotlin directory.
zh_cn: 你把它们写成 *.gradle 文件位于 src/main/groovy 目录中，或 *.gradle.kts 文件位于 src/main/kotlin 目录中。

source: Your plugin id should be a combination of components that reflect namespace (a reasonable pointer to you or your organization) and the name of the plugin it provides.
zh_cn: 插件 id 应该是反映名称空间(指向你或你的组织的合理指针)及其提供的插件名称的组件的组合。

source: etc
zh_cn: 等

source: for binary Gradle plugins that need to be resolved
zh_cn: 对于需要解析的二进制 Gradle 插件

source: for core Gradle plugins
zh_cn: 用于核心 Gradle 插件

source: for core Gradle plugins or plugins already available to the build script
zh_cn: 对于核心 Gradle 插件或已在构建脚本中可用的插件
